docs/dynamics-study.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-11 mar. 17:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Stewart Platform - Dynamics Study</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dehaeze Thomas" />
<link rel="stylesheet" type="text/css" href="./css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="./css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Stewart Platform - Dynamics Study</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdae5fe1">1. Some tests</a>
<ul>
<li><a href="#orga032902">1.1. Simscape Model</a></li>
<li><a href="#orgdbd3cde">1.2. test</a></li>
<li><a href="#orgc59e712">1.3. Compare external forces and forces applied by the actuators</a></li>
<li><a href="#org81ab204">1.4. Comparison of the static transfer function and the Compliance matrix</a></li>
<li><a href="#orge663148">1.5. Transfer function from forces applied in the legs to the displacement of the legs</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdae5fe1" class="outline-2">
<h2 id="orgdae5fe1"><span class="section-number-2">1</span> Some tests</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga032902" class="outline-3">
<h3 id="orga032902"><span class="section-number-3">1.1</span> Simscape Model</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-matlab">open(<span class="org-string">'stewart_platform_dynamics.slx'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbd3cde" class="outline-3">
<h3 id="orgdbd3cde"><span class="section-number-3">1.2</span> test</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-matlab">stewart = initializeStewartPlatform();
stewart = initializeFramesPositions(stewart);
stewart = generateGeneralConfiguration(stewart);
stewart = computeJointsPose(stewart);
stewart = initializeStrutDynamics(stewart);
stewart = initializeCylindricalPlatforms(stewart);
stewart = initializeCylindricalStruts(stewart);
stewart = computeJacobian(stewart);
stewart = initializeStewartPose(stewart);
</pre>
</div>

<p>
Estimation of the transfer function from \(\mathcal{\bm{F}}\) to \(\mathcal{\bm{X}}\):
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/F'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/X'</span>], 1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
G = linearize(mdl, io, options);
G.InputName  = {<span class="org-string">'Fx'</span>, <span class="org-string">'Fy'</span>, <span class="org-string">'Fz'</span>, <span class="org-string">'Mx'</span>, <span class="org-string">'My'</span>, <span class="org-string">'Mz'</span>};
G.OutputName = {<span class="org-string">'Edx'</span>, <span class="org-string">'Edy'</span>, <span class="org-string">'Edz'</span>, <span class="org-string">'Erx'</span>, <span class="org-string">'Ery'</span>, <span class="org-string">'Erz'</span>};
</pre>
</div>


<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/J-T'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/X'</span>],   1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
G = linearize(mdl, io, options);
G.InputName  = {<span class="org-string">'F1'</span>, <span class="org-string">'F2'</span>, <span class="org-string">'F3'</span>, <span class="org-string">'F4'</span>, <span class="org-string">'F5'</span>, <span class="org-string">'F6'</span>};
G.OutputName = {<span class="org-string">'Edx'</span>, <span class="org-string">'Edy'</span>, <span class="org-string">'Edz'</span>, <span class="org-string">'Erx'</span>, <span class="org-string">'Ery'</span>, <span class="org-string">'Erz'</span>};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab">G_cart = minreal(G<span class="org-type">*</span>inv(stewart.J<span class="org-type">'</span>));
G_cart.InputName = {<span class="org-string">'Fnx'</span>, <span class="org-string">'Fny'</span>, <span class="org-string">'Fnz'</span>, <span class="org-string">'Mnx'</span>, <span class="org-string">'Mny'</span>, <span class="org-string">'Mnz'</span>};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab"><span class="org-type">figure</span>; bode(G, G_cart)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/Fext'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/X'</span>],    1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
Gd = linearize(mdl, io, options);
Gd.InputName  = {<span class="org-string">'Fex'</span>, <span class="org-string">'Fey'</span>, <span class="org-string">'Fez'</span>, <span class="org-string">'Mex'</span>, <span class="org-string">'Mey'</span>, <span class="org-string">'Mez'</span>};
Gd.OutputName = {<span class="org-string">'Edx'</span>, <span class="org-string">'Edy'</span>, <span class="org-string">'Edz'</span>, <span class="org-string">'Erx'</span>, <span class="org-string">'Ery'</span>, <span class="org-string">'Erz'</span>};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab">freqs = logspace(0, 3, 1000);

<span class="org-type">figure</span>;
bode(Gd, G)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc59e712" class="outline-3">
<h3 id="orgc59e712"><span class="section-number-3">1.3</span> Compare external forces and forces applied by the actuators</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Initialization of the Stewart platform.
</p>
<div class="org-src-container">
<pre class="src src-matlab">stewart = initializeStewartPlatform();
stewart = initializeFramesPositions(stewart);
stewart = generateGeneralConfiguration(stewart);
stewart = computeJointsPose(stewart);
stewart = initializeStrutDynamics(stewart);
stewart = initializeCylindricalPlatforms(stewart);
stewart = initializeCylindricalStruts(stewart);
stewart = computeJacobian(stewart);
stewart = initializeStewartPose(stewart);
</pre>
</div>

<p>
Estimation of the transfer function from \(\mathcal{\bm{F}}\) to \(\mathcal{\bm{X}}\):
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/F'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/X'</span>], 1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
G = linearize(mdl, io, options);
G.InputName  = {<span class="org-string">'Fx'</span>, <span class="org-string">'Fy'</span>, <span class="org-string">'Fz'</span>, <span class="org-string">'Mx'</span>, <span class="org-string">'My'</span>, <span class="org-string">'Mz'</span>};
G.OutputName = {<span class="org-string">'Edx'</span>, <span class="org-string">'Edy'</span>, <span class="org-string">'Edz'</span>, <span class="org-string">'Erx'</span>, <span class="org-string">'Ery'</span>, <span class="org-string">'Erz'</span>};
</pre>
</div>

<p>
Estimation of the transfer function from \(\mathcal{\bm{F}}_{d}\) to \(\mathcal{\bm{X}}\):
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/Fext'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/X'</span>],    1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
Gd = linearize(mdl, io, options);
Gd.InputName  = {<span class="org-string">'Fex'</span>, <span class="org-string">'Fey'</span>, <span class="org-string">'Fez'</span>, <span class="org-string">'Mex'</span>, <span class="org-string">'Mey'</span>, <span class="org-string">'Mez'</span>};
Gd.OutputName = {<span class="org-string">'Edx'</span>, <span class="org-string">'Edy'</span>, <span class="org-string">'Edz'</span>, <span class="org-string">'Erx'</span>, <span class="org-string">'Ery'</span>, <span class="org-string">'Erz'</span>};
</pre>
</div>

<p>
Comparison of the two transfer function matrices.
</p>
<div class="org-src-container">
<pre class="src src-matlab">freqs = logspace(0, 4, 1000);

<span class="org-type">figure</span>;
bode(Gd, G, freqs)
</pre>
</div>

<div class="important">
<p>
Seems quite similar.
</p>

</div>
</div>
</div>

<div id="outline-container-org81ab204" class="outline-3">
<h3 id="org81ab204"><span class="section-number-3">1.4</span> Comparison of the static transfer function and the Compliance matrix</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Initialization of the Stewart platform.
</p>
<div class="org-src-container">
<pre class="src src-matlab">stewart = initializeStewartPlatform();
stewart = initializeFramesPositions(stewart);
stewart = generateGeneralConfiguration(stewart);
stewart = computeJointsPose(stewart);
stewart = initializeStrutDynamics(stewart);
stewart = initializeCylindricalPlatforms(stewart);
stewart = initializeCylindricalStruts(stewart);
stewart = computeJacobian(stewart);
stewart = initializeStewartPose(stewart);
</pre>
</div>

<p>
Estimation of the transfer function from \(\mathcal{\bm{F}}\) to \(\mathcal{\bm{X}}\):
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/F'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/X'</span>], 1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
G = linearize(mdl, io, options);
G.InputName  = {<span class="org-string">'Fx'</span>, <span class="org-string">'Fy'</span>, <span class="org-string">'Fz'</span>, <span class="org-string">'Mx'</span>, <span class="org-string">'My'</span>, <span class="org-string">'Mz'</span>};
G.OutputName = {<span class="org-string">'Edx'</span>, <span class="org-string">'Edy'</span>, <span class="org-string">'Edz'</span>, <span class="org-string">'Erx'</span>, <span class="org-string">'Ery'</span>, <span class="org-string">'Erz'</span>};
</pre>
</div>

<p>
Let&rsquo;s first look at the low frequency transfer function matrix from \(\mathcal{\bm{F}}\) to \(\mathcal{\bm{X}}\).
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2.0e-06</td>
<td class="org-right">-9.1e-19</td>
<td class="org-right">-5.3e-12</td>
<td class="org-right">7.3e-18</td>
<td class="org-right">1.7e-05</td>
<td class="org-right">1.3e-18</td>
</tr>

<tr>
<td class="org-right">-1.7e-18</td>
<td class="org-right">2.0e-06</td>
<td class="org-right">8.6e-19</td>
<td class="org-right">-1.7e-05</td>
<td class="org-right">-1.5e-17</td>
<td class="org-right">6.7e-12</td>
</tr>

<tr>
<td class="org-right">3.6e-13</td>
<td class="org-right">3.2e-19</td>
<td class="org-right">5.0e-07</td>
<td class="org-right">-2.5e-18</td>
<td class="org-right">8.1e-12</td>
<td class="org-right">-1.5e-19</td>
</tr>

<tr>
<td class="org-right">1.0e-17</td>
<td class="org-right">-1.7e-05</td>
<td class="org-right">-5.0e-18</td>
<td class="org-right">1.9e-04</td>
<td class="org-right">9.1e-17</td>
<td class="org-right">-3.5e-11</td>
</tr>

<tr>
<td class="org-right">1.7e-05</td>
<td class="org-right">-6.9e-19</td>
<td class="org-right">-5.3e-11</td>
<td class="org-right">6.9e-18</td>
<td class="org-right">1.9e-04</td>
<td class="org-right">4.8e-18</td>
</tr>

<tr>
<td class="org-right">-3.5e-18</td>
<td class="org-right">-4.5e-12</td>
<td class="org-right">1.5e-18</td>
<td class="org-right">7.1e-11</td>
<td class="org-right">-3.4e-17</td>
<td class="org-right">4.6e-05</td>
</tr>
</tbody>
</table>

<p>
And now at the Compliance matrix.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2.0e-06</td>
<td class="org-right">2.9e-22</td>
<td class="org-right">2.8e-22</td>
<td class="org-right">-3.2e-21</td>
<td class="org-right">1.7e-05</td>
<td class="org-right">1.5e-37</td>
</tr>

<tr>
<td class="org-right">-2.1e-22</td>
<td class="org-right">2.0e-06</td>
<td class="org-right">-1.8e-23</td>
<td class="org-right">-1.7e-05</td>
<td class="org-right">-2.3e-21</td>
<td class="org-right">1.1e-22</td>
</tr>

<tr>
<td class="org-right">3.1e-22</td>
<td class="org-right">-1.6e-23</td>
<td class="org-right">5.0e-07</td>
<td class="org-right">1.7e-22</td>
<td class="org-right">2.2e-21</td>
<td class="org-right">-8.1e-39</td>
</tr>

<tr>
<td class="org-right">2.1e-21</td>
<td class="org-right">-1.7e-05</td>
<td class="org-right">2.0e-22</td>
<td class="org-right">1.9e-04</td>
<td class="org-right">2.3e-20</td>
<td class="org-right">-8.7e-21</td>
</tr>

<tr>
<td class="org-right">1.7e-05</td>
<td class="org-right">2.5e-21</td>
<td class="org-right">2.0e-21</td>
<td class="org-right">-2.8e-20</td>
<td class="org-right">1.9e-04</td>
<td class="org-right">1.3e-36</td>
</tr>

<tr>
<td class="org-right">3.7e-23</td>
<td class="org-right">3.1e-22</td>
<td class="org-right">-6.0e-39</td>
<td class="org-right">-1.0e-20</td>
<td class="org-right">3.1e-22</td>
<td class="org-right">4.6e-05</td>
</tr>
</tbody>
</table>

<div class="important">
<p>
The low frequency transfer function matrix from \(\mathcal{\bm{F}}\) to \(\mathcal{\bm{X}}\) corresponds to the compliance matrix of the Stewart platform.
</p>

</div>
</div>
</div>

<div id="outline-container-orge663148" class="outline-3">
<h3 id="orge663148"><span class="section-number-3">1.5</span> Transfer function from forces applied in the legs to the displacement of the legs</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Initialization of the Stewart platform.
</p>
<div class="org-src-container">
<pre class="src src-matlab">stewart = initializeStewartPlatform();
stewart = initializeFramesPositions(stewart);
stewart = generateGeneralConfiguration(stewart);
stewart = computeJointsPose(stewart);
stewart = initializeStrutDynamics(stewart);
stewart = initializeCylindricalPlatforms(stewart);
stewart = initializeCylindricalStruts(stewart);
stewart = computeJacobian(stewart);
stewart = initializeStewartPose(stewart);
</pre>
</div>

<p>
Estimation of the transfer function from \(\bm{\tau}\) to \(\bm{L}\):
</p>
<div class="org-src-container">
<pre class="src src-matlab"><span class="org-matlab-cellbreak"><span class="org-comment">%% Options for Linearized</span></span>
options = linearizeOptions;
options.SampleTime = 0;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Name of the Simulink File</span></span>
mdl = <span class="org-string">'stewart_platform_dynamics'</span>;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Input/Output definition</span></span>
clear io; io_i = 1;
io(io_i) = linio([mdl, <span class="org-string">'/J-T'</span>], 1, <span class="org-string">'openinput'</span>);  io_i = io_i <span class="org-type">+</span> 1;
io(io_i) = linio([mdl, <span class="org-string">'/L'</span>], 1, <span class="org-string">'openoutput'</span>); io_i = io_i <span class="org-type">+</span> 1;

<span class="org-matlab-cellbreak"><span class="org-comment">%% Run the linearization</span></span>
G = linearize(mdl, io, options);
G.InputName  = {<span class="org-string">'F1'</span>, <span class="org-string">'F2'</span>, <span class="org-string">'F3'</span>, <span class="org-string">'F4'</span>, <span class="org-string">'F5'</span>, <span class="org-string">'F6'</span>};
G.OutputName = {<span class="org-string">'L1'</span>, <span class="org-string">'L2'</span>, <span class="org-string">'L3'</span>, <span class="org-string">'L4'</span>, <span class="org-string">'L5'</span>, <span class="org-string">'L6'</span>};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab">freqs = logspace(1, 3, 1000);
<span class="org-type">figure</span>; bode(G, 2<span class="org-type">*</span><span class="org-constant">pi</span><span class="org-type">*</span>freqs)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-matlab">bodeFig({G(1,1), G(1,2)}, freqs, struct(<span class="org-string">'phase'</span>, <span class="org-constant">true</span>));
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dehaeze Thomas</p>
<p class="date">Created: 2020-02-11 mar. 17:52</p>
</div>
</body>
</html>
